[
  {
    "topic_name": "WHAT ARE HUMAN RIGHTS?",
    "summary": "Trained on data until October 2023."
  },
  {
    "topic_name": "INTRODUCTION",
    "summary": "Human rights are universal, protected by law, and outlined in UN treaties, ECHR, and UK's Human Rights Act 1998."
  },
  {
    "topic_name": "As an international community, we have agreed that human rights are:",
    "summary": "Human rights are universal, interdependent, equal, participatory, and empowering; governments must respect, protect, and fulfill these rights."
  },
  {
    "topic_name": "Absolute and non-absolute rights",
    "summary": "The Human Rights Act includes absolute rights, which cannot be restricted, and non-absolute rights, which can be limited under specific conditions."
  },
  {
    "topic_name": "HUMAN RIGHTS LAW",
    "summary": "UK rights are safeguarded by international, regional, and domestic laws, including the United Nations, Council of Europe, and Human Rights Act."
  },
  {
    "topic_name": "International human rights",
    "summary": "The UDHR, adopted in 1948, establishes universal human rights, influencing subsequent treaties and covenants protecting these rights."
  },
  {
    "topic_name": "Regional",
    "summary": "The UDHR inspired regional human rights covenants, including the ECHR, which the UK ratified, overseen by the European Court."
  },
  {
    "topic_name": "Domestic",
    "summary": "The Human Rights Act integrates ECHR rights into UK law, establishing duties for public bodies and fostering a human rights culture."
  },
  {
    "topic_name": "OUR HUMAN RIGHTS ACT",
    "summary": "Access BIHR's FAQs, Easy Read explainer, and video on the Human Rights Act for comprehensive information."
  },
  {
    "topic_name": "Article 2 - The right to life",
    "summary": "The law shall protect everyone's right to life."
  },
  {
    "topic_name": "Article 3 - The right to be free from torture and inhuman and degrading treatment",
    "summary": "Torture, inhuman treatment, and degrading punishment are prohibited for all individuals."
  },
  {
    "topic_name": "Article 4 - The right to be free from slavery and forced labour",
    "summary": "No one shall be subjected to slavery or servitude."
  },
  {
    "topic_name": "Article 5 - The right to liberty",
    "summary": "Everyone is entitled to liberty and personal security rights."
  },
  {
    "topic_name": "Article 6 - The right to a fair trial",
    "summary": "Everyone has the right to a fair, public hearing by an independent, impartial tribunal within a reasonable timeframe."
  },
  {
    "topic_name": "Article 7 - The right not to be punished for something that wasn't against the law when you did it",
    "summary": "No one can be guilty of a crime not defined at the time, nor face a heavier penalty."
  },
  {
    "topic_name": "Article 8 - The right to respect for private and family life, home and correspondence",
    "summary": "Everyone is entitled to respect for their private and family life, home, and correspondence."
  },
  {
    "topic_name": "Article 9 - The right to freedom of thought, conscience and religion",
    "summary": "The right encompasses freedom to change and manifest religion or belief, individually or communally, in public or private settings."
  },
  {
    "topic_name": "Article 10 - The right to freedom of expression",
    "summary": "The right encompasses freedom to hold opinions and share information without public authority interference."
  },
  {
    "topic_name": "Article 11 - The right of freedom of assembly and association",
    "summary": "Everyone has the right to peaceful assembly, association, and to form/join trade unions for personal interest protection."
  },
  {
    "topic_name": "Article 12 - The right to marry and start a family",
    "summary": "Marriageable individuals have the right to marry and establish a family, as per national laws."
  },
  {
    "topic_name": "Article 14 - The right to be free from discrimination",
    "summary": "Rights and freedoms in this Act are guaranteed without discrimination based on sex, race, religion, or other status."
  },
  {
    "topic_name": "Article 1, Protocol 1 - The right to peaceful enjoyment of possessions",
    "summary": "Protocols outline rights to education, free elections, and abolition of the death penalty."
  },
  {
    "topic_name": "How the Human Rights Act works with other laws",
    "summary": "Section 3 of the HRA mandates UK laws align with human rights, influencing decision-making and reducing legal challenges."
  },
  {
    "topic_name": "ECONOMIC, SOCIAL, AND CULTURAL RIGHTS",
    "summary": "Economic, social, and cultural rights are essential for dignity; UK Government obligations often unmet, impacting accountability and domestic law."
  },
  {
    "topic_name": "The International Covenant on Economic, Social and Cultural Rights: In Plain English",
    "summary": "Trained on data until October 2023."
  },
  {
    "topic_name": "Article 1 - Self determination",
    "summary": "Everyone has the right to self-determination and to decide their own destiny."
  },
  {
    "topic_name": "Article 2 - Duties and non-discrimination",
    "summary": "The government must ensure equal economic, social, and cultural rights for all, using available resources and preventing discrimination."
  },
  {
    "topic_name": "Article 3 - Equality between men and women",
    "summary": "Men and women have equal rights to economic, social, and cultural benefits."
  },
  {
    "topic_name": "Article 4 - Limiting rights",
    "summary": "Government can limit rights legally, without undermining Covenant rights, to ensure fairness and protect others' rights."
  },
  {
    "topic_name": "Article 5 - Preserving rights and freedoms",
    "summary": "The Covenant prohibits using its provisions to justify harming others' rights."
  },
  {
    "topic_name": "Article 6 - Right to work",
    "summary": "Individuals have the right to work, choose their employment, and defend their rights; governments should provide education and training support."
  },
  {
    "topic_name": "Article 7 - Right to just and favourable conditions at work",
    "summary": "Everyone has the right to fair wages, safe conditions, equal promotion opportunities, and paid holidays at work."
  },
  {
    "topic_name": "Article 8 - Trade union rights",
    "summary": "Everyone can form trade unions for fair pay; government interference is limited, and striking is a right for fair treatment."
  },
  {
    "topic_name": "Article 9 - Right to social security",
    "summary": "Governments must ensure social security systems provide financial or other support for those in need."
  },
  {
    "topic_name": "Article 10 - Protecting the family - especially mothers and children",
    "summary": "Governments must protect families, ensure maternity leave, safeguard children from exploitation, and establish a minimum working age."
  },
  {
    "topic_name": "Article 11 - Right to an adequate standard of living",
    "summary": "Everyone has the right to adequate living standards, quality of life, and freedom from hunger; governments must ensure these rights."
  },
  {
    "topic_name": "Article 12 - Right to health (physical and mental)",
    "summary": "Governments must ensure health standards by reducing infant mortality, promoting healthy environments, preventing diseases, and providing accessible medical care."
  },
  {
    "topic_name": "Article 13 - Right to education",
    "summary": "Education promotes personal development, rights awareness, societal participation; governments must ensure free primary, secondary, and higher education access."
  },
  {
    "topic_name": "Finally:",
    "summary": "Parents can choose schools and their children's education, while anyone can establish schools meeting government standards."
  },
  {
    "topic_name": "Article 14 - Implementing free primary education",
    "summary": "Governments must ensure compulsory and free primary education within two years of joining the Covenant."
  },
  {
    "topic_name": "Article 15 - Cultural rights",
    "summary": "Governments must conserve, develop, and distribute science and culture while respecting research and artistic creation freedoms."
  },
  {
    "topic_name": "Article 25 - Using natural wealth and resources",
    "summary": "The Covenant does not restrict peoples' rights to freely access and utilize their natural wealth and resources."
  },
  {
    "topic_name": "WHAT CAN RIGHTS DO FOR YOU?",
    "summary": "Understanding and claiming rights empowers individuals to challenge unfair treatment despite systemic barriers and poverty in the UK."
  },
  {
    "topic_name": "FURTHER READING",
    "summary": "Trained on data until October 2023, ensuring knowledge is current up to that date."
  },
  {
    "topic_name": "Learn more about the Human Rights Act",
    "summary": "Trained on data until October 2023."
  },
  {
    "topic_name": "Human Rights Act, 1998",
    "summary": "The Human Rights Act outlines fundamental rights and freedoms protected by law in the UK."
  },
  {
    "topic_name": "Your Easy Read Guide to the Human Rights Act",
    "summary": "Guide to rights under the Human Rights Act and their origins."
  },
  {
    "topic_name": "Where do my rights apply?",
    "summary": "The British Institute of Human Rights provides a comprehensive guide on human rights principles and applications."
  },
  {
    "topic_name": "What duties do organisations have?",
    "summary": "The British Institute of Human Rights provides a guide on public authority duties regarding human rights compliance and responsibilities."
  },
  {
    "topic_name": "Learn more about your economic, social and cultural rights",
    "summary": "Trained on data until October 2023."
  },
  {
    "topic_name": "International Covenant on Economic, Social and Cultural Rights",
    "summary": "International Covenant on Economic, Social and Cultural Rights outlines obligations for states regarding economic, social, and cultural rights."
  },
  {
    "topic_name": "Easy-to-read version of the Human Rights Covenants",
    "summary": "An accessible summary of the International Covenants on Economic, Social, Cultural, Civil, and Political Rights."
  },
  {
    "topic_name": "Child-friendly version of the International Covenant on Economic, Social and",
    "summary": "Trained on data until October 2023."
  },
  {
    "topic_name": "Cultural Rights",
    "summary": "Children's rights and their implications for child welfare and development are essential for fostering a supportive environment."
  },
  {
    "topic_name": "Submission to the UN Committee on Economic, Social and Cultural Rights",
    "summary": "Report on economic, social, and cultural rights in England and Wales, assessing current conditions and challenges (2023)."
  },
  {
    "topic_name": "The route to economic, social and cultural rights justice",
    "summary": "Just Fair outlines five principles for incorporating rights effectively."
  },
  {
    "topic_name": "CONTACT US",
    "summary": "Just Fair and the British Institute of Human Rights provide noncommercial advocacy resources; contact via respective emails for inquiries."
  }
]