[
  {
    "topic_name": "PSYCHOLOGY: DEFINITION, GOALS AND BRANCHES",
    "content": "By: Dr. Ruchi Tewari\n\nAcademic Consultant (Psychology)\n\nUttarakhand Open University\n\n- · Psychology is the study of mind and behavior.\n- · It encompasses the biological influences, social pressures, and environmental factors that affect how people think, act, and feel.\n- · Psychology is defined as a science which studies mental processes, experiences and\n- behavior in different contexts.\n\nIn doing so, it uses methods of biological and social sciences to obtain data systematically.\n\nIt makes sense of the data so that it can be organized as knowledge.\n\n- · Mental process:\n- (i) Mental processes are activities of the mind and brain, related to cognition.\n- (ii) We use mental processes when we think or remember something, or solve a problem.\n- (iii) However, these mental activities are -different from neural activities, though they are mutually overlapping processes.\n- (iv) The mind emerges and evolves as our interactions and experiences in this world get dynamically organized in the form of a system which is responsible for the occurrence of various mental processes.\n- (v) Mental processes include reasoning, learning, thinking, problem solving, perception, etc."
  },
  {
    "topic_name": "· Experiences:",
    "content": "Experiences can be defined as the learning acquired through everyday life situation. (i) Experiences are subjective in nature, different for every individual.\n\n- (ii) We cannot directly observe or know someone's experience.\n- (iii) Only the experiencing person can be aware or conscious of his/her experiences. Thus, experiences are imbedded in our awareness or consciousness.\n- (iv) Experiences are influenced by internal and external conditions of the experiences.\n- (v) The nature of the experience can only be understood by analyzing a complex set of internal and external conditions.\n- (vi) Experiences are important because most of our learning is based on experiences."
  },
  {
    "topic_name": "· Behaviors:",
    "content": "- (i) Behaviors are responses or reactions we make or activities we engage in. E.g. One can feel the heart pounding before taking an examination.\n- (ii) Some behaviors such as thinking may be simple or complex, short or enduring.\n- (iii) On the other hand, some behaviors can be outwardly seen or sensed and are called overt, for example laughing.\n- (iv) All behaviors can be explained on the basis of S-R (Stimulus Response Relations). Any behavior, overt or covert, is associated with or triggered by a stimulus.\n- (v) Both stimulus and response can be internal or external.\n- (vi) The same stimulus can have different responses, due to the organism variable. It emphasizes upon an individual's uniqueness and variation that make him different from other."
  },
  {
    "topic_name": "· Psychology as a discipline",
    "content": "- (i) It studies behavior, experience and mental processes.\n- (ii) It seeks to understand and explain how the mind works and how different mental processes result in different behaviors.\n- (iii) When we observe others, our own point of view or ways of understanding the world influence our interpretations of their behaviors and experiences.\n- (iv) Psychologists try to minimize such biases in their explanations of behavior and experience in various ways.\n- (v) Some do so by making their analysis scientific and objective.\n- (vi) Others seek to explain behavior from the point of view of those experiencing persons because they think that selectivity is a necessary aspect of human experience.\n- - Neuroscience and computer science borrow principles continuously from psychology.\n\nThere are fast developing brain imaging techniques like MRI, ECG, etc. which make it\n\npossible to study brain processes in real time, i.e., when they are actually taking place."
  },
  {
    "topic_name": "Psychology as hybrid science :",
    "content": "Psychology is a hybrid science that draws its influence from both natural and social sciences."
  },
  {
    "topic_name": "· As a natural science :",
    "content": "- (i) Modem Psychology has developed because of the application of the scientific method to study, psychological phenomenon.\n- (ii) As a physical science, it emphasizes on data that is systematic and can be studied under controlled conditions.\n- (iii) It is quantitative and requires analysis.\n- (iv) It takes influences from both physics and biology and believes in the Hypothetico Deductive Model (HDM).\n- (v) Every or any hypothesis can be accepted or rejected on the basis of factors available. The model suggests that scientific advancement can take place if you have a theory to explain a phenomenon.\n- (vi) A hypothesis is a tentative solution to a problem that helps in guiding a research or a theory.\n- (vii) Hypothesis has been successfully used for determining many theories related to learning and memory. For example, the way a child has been brought up in his family will shape his personality."
  },
  {
    "topic_name": "Definitions of Psychology:",
    "content": "Etymologically psychology means the science of the soul, viz., 'psyche' mean 'soul' and 'logos' means 'science.'\n\nThe earlier psychologists maintained that the function of psychology was to study the nature, origin and the destiny of the human soul.\n\nModern psychologists, however, doubt the existence of the soul since there is no empirical evidence for its existence.\n\nMany of the earlier psychologists, however, believed in the existence of the mind.\n\nSome contemporary psychologists also believe in the existence of the mind."
  },
  {
    "topic_name": "(i) Psychology is the Science of Mind:",
    "content": "- · In 1892 William James defined psychology as the 'science of mental processes'.\n- · In his view, psychology may be defined in terms of conscious states."
  },
  {
    "topic_name": "(ii) Psychology is the Science of Consciousness:",
    "content": "- · In 1884 James Sully defined psychology as the science of the 'inner world' as distinguished from physical science which study the physical phenomena.\n- · In 1892 Wilhelm Wundt defined psychology as the science which studies the 'internal experiences'."
  },
  {
    "topic_name": "(iii) Psychology is the Science of Behavior:",
    "content": "- · In 1905 William McDougall defined psychology as the 'science of behavior'.\n- · In 1911 W. B. Pillsbury also defined psychology as the 'science of behavior'.\n- · J. B. Watson, however, discarded the concepts of the 'mind', 'consciousness', 'purpose' and the like from psychological use, and defined psychology as 'the science of behavior'.\n- (iv) Psychology is the Science of the Experience and Behavior of the Individual in Relation to his Environment:\n- · K. Koffka holds that even though the concept of 'consciousness' cannot be completely discarded from psychological vocabulary the main aim of psychology is the study of behavior.\n- · R. S. Woodworth defines psychology as the 'science of activities of the individual.'"
  },
  {
    "topic_name": "The Four Goals Of Psychology:",
    "content": "- · The study of psychology has Four Goals -\n- 1. Describe :\n- · Describing things is something we do every single day with no conscious thought or effort. But describing in psychology has a slightly different meaning than the describing we do in our everyday life.\n- · Describing a problem, an issue, or behavior is the first goal of psychology.\n- · Descriptions help psychologists to distinguish between normal and abnormal behavior and gain a more accurate understanding and perspective on human and animal behavior, actions, and thoughts.\n- 2. Explain :\n- · Psychologists are very interested in being able to explain behavior rather than just being able to describe it.\n- · This helps in providing answers to questions about why people react in a certain way, why they do the things they do and the factors which affect their personality, their mental health, their actions, etc."
  },
  {
    "topic_name": "3. Predict :",
    "content": "- · Making predictions about how we think, and act is the third goal of psychology. By looking at past observed behavior (describing and explaining) psychologists aim to predict how that behavior will appear again in the future and whether other people might exhibit the same behavior.\n- · Through the process of describing an explanation, psychologists are able to understand more about what thoughts, feelings, and behaviors are contributing factors.\n- · They can then use that knowledge to predict why, when, and how those things might happen in the future."
  },
  {
    "topic_name": "4. Change / Control :",
    "content": "- · Psychology aims to change, influence, or control behavior to make positive, constructive, meaningful, and lasting changes in people's lives and to influence their behavior for the better. This is the final and most important goal of psychology."
  },
  {
    "topic_name": "How Can You Use the Four Goals in Your Life?",
    "content": "If you're trying to change something in your life or develop a healthier habit, consider using the four goals. To start, visualize your goal. What is that you want? Once you have that goal in mind, start with describing by writing down your thoughts, feelings, emotions, and what is going on in your life. This will help breakdown and clarify your thoughts if they are chaotic or jumbled. You can also make a list, create a mind-map or choose other ways of recording your thoughts. Try to be as detailed as possible.\n\nExplaining is the process of trying to figure out what is going on, and this can be done by reflecting on a personal experience that might hold some type of explanation for your habit or behavior. Asking yourself \"why\" questions can be helpful in reaching the goal of explaining.\n\nTaking notes from describing and explaining might help you to be able to predict future thoughts and behaviors. For example, maybe you have described feeling anxiety when faced with a social event. Through the process of asking yourself why you feel anxious, you might come to the conclusion that you feel anxious because you're scared that people might not like you. From this, you can predict the next time you attend an event, you will probably feel anxious again. With this prediction, you can then work on acting, or reacting in certain ways to help you control or curb the anxiety, which leads us to the"
  },
  {
    "topic_name": "Branches of psychology :",
    "content": "- · There are different types of psychology that serve different purposes. There is no fixed way of classifying them, but here are some common types."
  },
  {
    "topic_name": "1. Abnormal Psychology",
    "content": "Abnormal psychology dedicated to patients who display abnormal behavior or thinking. Abnormal behavior is considered conduct that doesn't comply with societal norms, which can include mental illnesses such as bulimia or schizophrenia. Psychologists in this field try to understand what causes unusual behaviors in people, whether it stems from a biological origin (nature) or learned through experiences (nurture)."
  },
  {
    "topic_name": "2. Behavioral Psychology",
    "content": "Psychologists who study the connection between the mind and subsequent behaviors are behavioral psychologists. Behavioral psychologists counsel, diagnose and treat patients with behavioral disorders. By better understanding behaviors, the psychologists hope to better predict how people will behave in different situations. Behavioral psychologists study how habits form in people, and how the mind plays a role in a physical response."
  },
  {
    "topic_name": "3. Clinical Psychology",
    "content": "Clinical psychology relates to psychologists directly providing comprehensive healthcare to patients who are suffering from mental illness. Clinical psychologists interact with patients through observations, interviews and tests before making a diagnosis and coming up with a plan to deal with the symptoms of a mental illness. Many psychologists in this field use psychoanalysis, a psychological theory and form of therapy for treating mental disorders in patients. Over the course of multiple visits, psychologists delve into the emotions and experiences of a patient to provide insight into the illness."
  },
  {
    "topic_name": "4. Cognitive Psychology",
    "content": "Concerned with mental processes, cognitive psychologists study the human thought process and how people obtain, process, and store information in the brain. These psychologists conduct experiments and research to study memory, perception, and learning. They work to better understand the mind and find solutions to memory loss, learning disabilities, and other cognitive issues."
  },
  {
    "topic_name": "5. Counseling Psychology",
    "content": "Patients who are suffering through stressful moments in life could be advised to see a counseling psychologist. Counseling psychologists treat patients who are experiencing an emotional strain caused by social or physical factors. This differs from clinical psychologists, who treat and diagnose patients with mental disorders. Marriage and grief counselors would be considered part of counseling psychology. The counselors assess patients and then advise them with a personalized plan to improving their well-being and decreasing stress."
  },
  {
    "topic_name": "6. Developmental Psychology",
    "content": "Developmental psychologists have helped us better understand how people mature over the course of their lives, both emotionally and physically, studying human development from birth until old age. Specifically, psychologists take an in-depth look at biological growth of the body, cognitive expansion and emotional maturity, among other areas of study. When working with patients, developmental psychologists assess and diagnose to treat various issues, such as developmental delays in children. Some of these delays are common, and a psychologist could diagnose therapy to help the child catch up or just observation to see how the child improves on his or her own."
  },
  {
    "topic_name": "7. Educational Psychology",
    "content": "Educational psychologists study factors that impact learning, including learning methods and how information is processed and absorbed. Memory, concepts, and individual differences all affect how a person learns. In researching these processes, psychologists apply theories of human development to better understand how to improve the instructional process."
  },
  {
    "topic_name": "8. Experimental Psychology",
    "content": "Experimental psychologists conduct investigations into basic psychological processes, such as attention, perception, memory, and reasoning. Arguably, many psychologists could be considered experimental in that research impacts much of this field. However, the sole mission of experimental psychologists is conducting and publishing research on either human or animal behaviors. Their findings often contribute to work across many branches and builds on a larger conclusion."
  },
  {
    "topic_name": "9. Forensic Psychology",
    "content": "Forensic psychologists work in the intersection of the legal system and the field of psychology. They often conduct evaluations and research that help guide legal proceedings. This can include evaluating a defendant for competency to stand trial or helping train police officers and first responders on how to properly handle criminals and crime scenes. While many forensic psychologists work within the legal system, some work in threat assessment, which is the scientific approximation of whether a person will become a threat in the future."
  },
  {
    "topic_name": "10. Health Psychology",
    "content": "In 1977, George L. Engel developed the biopsychosocial model, or the idea that biological, psychological, and social factors influence disease and illness. In time, this has become the model used by health psychologists to study how and why people get sick. These psychologists help people make choices that have a positive impact on their health, as well as that of their families and communities. Their patients range from those with genetic disorders to substance abuse issues."
  },
  {
    "topic_name": "11. Human Factors Psychology",
    "content": "Human factors psychologists use research to improve transportation, consumer products, telecommunication, technology - nearly anything and any system with which humans interact. Their goal is to create safer and more effective systems by better understanding people's expectations and how they interact with products and technology. These psychologists conduct research and consult with companies on how to ensure a safe working environment for employees."
  },
  {
    "topic_name": "12. Industrial - Organizational Psychology",
    "content": "Industrial-Organizational Psychology, also known as I/O psychology, serves to study how human behavior impacts industry and organizations. I/O psychologists evaluate a work situation and develop a plan for the optimal performance and work-life balance in that situation for the employees. I/O psychologists specialize in designing and executing research done on workplace setups as well as studying decision-making theories."
  },
  {
    "topic_name": "13. Personality Psychology",
    "content": "Personality psychologists work to explain why people display certain types of behavior, such as aggression, and study the differences between disorders. Psychologists in this branch study individual differences in personality characteristics, such as conscientiousness, as well as how personality characteristics interact to create a personality. Additionally, personality psychologists study the influence of expressed genes and how that affects personality. Although mainly working in research, they can provide treatment to people with personality disorders."
  },
  {
    "topic_name": "14. School Psychology",
    "content": "Creating a safe and healthy school environment is the goal of every school psychologist. These psychologists focus on helping find the best environment for student learning as well as helping teachers or students find their optimal learning space. They study social, behavioral, emotional, and academic factors to find the best situation for students. They also conduct research on the best practices for school policy and make recommendations for school administrators to adopt."
  },
  {
    "topic_name": "15. Social Psychology",
    "content": "Social psychologists strive to understand individual behaviors and personalities within a social context. Psychologists in this branch study the social factors that influence how people act and the condition in which those actions occur. Most social psychologists research and observe social influence, group processes, prejudice or discrimination, and stereotypes. Over the years, SOCIAL PSYCHOLOGISTS have helped better the understanding of people's attitudes, willingness to conform to a group, and social decision-making."
  },
  {
    "topic_name": "16. Sports Psychology",
    "content": "Sports psychologists help athletes achieve optimal performance on the field. Psychologists in this subset study how sports affect human psychology and vice versa. In applied settings, sports psychologists work with athletes (from youth to adults), parents, coaches, and more regarding injuries and rehabilitation, positive communication, and team building.\n\n<!-- image -->"
  }
]