[
  {
    "topic_name": "WHAT ARE HUMAN RIGHTS?",
    "content": ""
  },
  {
    "topic_name": "INTRODUCTION",
    "content": "Human rights are the rights we are all entitled to simply by virtue of being human. They belong to us equally regardless of our age, disability, race, religion/belief, sex, sexuality, or other status. They are based on values such as fairness, respect, equality and dignity but they are more than just nice ideas; they are protected in law.\n\nAs we will explore below, various United Nations (UN) treaties, the European Convention on Human Rights (ECHR) and the UK's Human Rights Act 1998 (HRA) set out rules for how those in positions of public power must treat individuals.\n\nThis resource introduces rights under the UK Human Rights Act 1998, and the International Covenant on Economic, Social and Cultural Rights, an international treaty ratified by the UK in 1976, the concepts that underpin them, and the laws that protect them.\n\nIt is designed to help civil society activists in the UK claim 'the right to talk about rights' and feel more confident to start conversations in communities about taking rights-based approaches to address the issues that matter to them.\n\n'the starting point should be the same as that for everyone else ... This flows inexorably from the universal character of human rights, founded on the inherent dignity of all human beings.'\n\n- Lady Hale, Supreme Court, in P v Cheshire West & Chester Council etc. (2014)\n\n<!-- image -->\n\nThis guide is for information purposes only. It is not intended, and not be used as, legal advice or guidance. The law referred to in this guide may have changed since it was published."
  },
  {
    "topic_name": "As an international community, we have agreed that human rights are:",
    "content": "- Universal and inalienable - this means that human rights belong to all of us, no matter what and cannot be taken away (although some can be restricted for a time if clear criteria are met, for example we can go to prison if we commit a crime).\n- Interdependent and indivisible - this means that all rights are equal to each other in importance, but also that for rights to work properly, we must have all our rights at the same time. For example, our right to life is dependent on having enough food to eat. And our right to start a family means having a home we can raise our children in.\n- Equal and non-discriminatory - this means that every person is equal in importance and dignity to ever other person in the world from the beginning, until the end of their lives. Nobody should face any barriers to their rights because of their age, disability, race, religion/belief, sex, sexuality, or other status.\n- Participatory and empowering - this means that the journey of realising rights is as important to the destination. Change is achieved with the people, rather than for them, and every person should be enabled to have their voice heard at every stage of the rights realisation journey. This may mean providing education, training, or capacity-building to the public, organisations and campaigners.\n\nUnder human rights law, the UK Government, public authorities, and other 'duty bearers' are accountable for ensuring we experience our rights. This means they have the responsibility to:\n\n- Respect rights - This means treating people fairly, not interfering with our rights or preventing us from enjoying them. This includes accommodating religions or beliefs and ensuring free and fair elections.\n- Protect rights - This means stopping others from interfering with our rights. This includes taking positive action to protect people from harm, including introducing laws to protect us from discrimination.\n- Fulfil rights - This means investigating when rights have been risked and putting in places laws, policies and programmes that ensure it does not happen again and that we can all enjoy our rights. This includes ensuring that we know our rights, and providing the things that help us realise them - such as enough schools and access to a social security system.\n\nYou can read BIHR's explainer on who is considered to have public power and therefore has duties to respect and protect your human rights here.\n\n<!-- image -->\n\n<!-- image -->\n\nTHIS IS AN EXAMPLE OF INDIVIDUALS USING HUMAN RIGHTS LANGUAGE AS A TOOL FOR ADVOCACY: CELINE'S STORY\n\nCeline lives in London and has just been granted refugee status. She must go to hospital for a couple of weeks. Celine has been learning English for a while, but is still not very comfortable using English, especially with the doctors who are using complicated medical terms.\n\nA doctor comes to give her the results of several tests she has had. Celine doesn't really understand what he has told her. She asks for a translator but is told that her English is good enough and she doesn't need one. Celine's friend visits her in hospital and tells her that she can use her human rights. They tell the hospital staff that this is impacting Celine's right to wellbeing and autonomy (part of the right to private and family life (Article 8, HRA/ECHR) as she cannot properly understand and talk about her treatment without a translator and that this is discrimination (Article 14, HRA/ECHR). The hospital staff agree and change their policy so that a translator is always offered to people who do not have English as a first language.\n\n- - Befriending Group advocacy story from BIHR"
  },
  {
    "topic_name": "Absolute and non-absolute rights",
    "content": "You can read a plain language or an Easy Read guide of each of the 16 rights in the Human Rights Act and whether they are absolute or non-absolute here.\n\nSome of our human rights are absolute, meaning they can never be restricted, limited or interfered with. There is never any good reason or justification for interfering with absolute rights.\n\nExamples of absolute rights:\n\n- The right to life (Article 2, Human Rights Act/European Convention on Human Rights)\n\n<!-- image -->\n\n- The right to be free from torture and inhuman or degrading treatment (Article 3, Human Rights Act/European Convention on Human Rights)\n- The right to a fair trial (Article 6, Human Rights Act/European Convention on Human Rights)\n\nNon-absolute rights are rights that can be restricted of limited in some situations. The majority of rights in the Human Rights Act, for example, are nonabsolute. However, for them to be restricted, they must pass a three-stage test whereby the decision must be:\n\n- i. Lawful - there is a law allowing it\n- ii. Legitimate - there is a genuine aim or reason for doing it\n- iii. Proportionate - it's the least restrictive way to meet that aim\n\n<!-- image -->\n\nTHIS IS AN EXAMPLE OF FREEDOM OF EXPRESSION (ARTICLE 10, HRA) SHOWING HOW HUMAN RIGHTS APPLY TO EVERYONE UNIVERSALLY: MARK'S STORY\n\nMark put a poster up in the window of his flat, showing a picture of the Twin Towers in New York on fire, with a caption reading \"Islam out of Britain Protect the British People\" and a symbol of the crescent and star in a prohibition sign.\n\nMark was charged with the aggravated offence of displaying a writing/sign that was threatening, abusive or insulting, and that showed hostility towards a racial or religious group. Mark was convicted, and he appealed to the High Court. He argued that he had the right to freedom of expression, which includes speech that may be provocative and contentious. The Court ruled however that freedom of expression can be limited to protect the rights of others, and in this case Mark's poster was a \"public expression of attack on all Muslims in the United Kingdom\". Mark's appeal failed.\n\n(Norwood v UK, 2004)\n\n<!-- image -->"
  },
  {
    "topic_name": "HUMAN RIGHTS LAW",
    "content": "In the UK, our rights are protected by international (e.g. United Nations), regional (e.g. Council of Europe), and domestic laws (e.g. Human Rights Act), programmes, and practices."
  },
  {
    "topic_name": "International human rights",
    "content": "The Universal Declaration of Human Rights (UDHR) sets the foundation for modern human rights law, recognising the rights and freedoms of all human beings everywhere.\n\nThe Declaration was adopted by the United Nations (UN) on 10 December 1948 in response to the atrocities of the Second World War. In adopting the Declaration, the UN General Assembly recognised human rights as the foundation of a more free and peaceful future.\n\nWithin its 30 rights and freedoms, the Declaration marks out our universal rights to be free from slavery, torture, and discrimination to access justice and seek asylum, to peacefully assemble and express ourselves, to gain an education and work, and to live a decent life with food on the table and a roof over our heads.\n\nThe Declaration and the principles within it form the foundations of further human rights covenants and treaties that serve to outline and protect our rights, including the:\n\n<!-- image -->\n\n<!-- image -->\n\n- International Convention on the Elimination of All Forms of Racial Discrimination (1969)\n- International Covenant on Economic, Social and Cultural Rights (1976)\n- International Covenant on Civil and Political Rights (1976)\n- Convention on the Elimination of All Forms of Discrimination against Women (1979)\n- Convention against Torture and Other Cruel, Inhuman or Degrading Treatment (1987)\n- Convention on the Rights of the Child (1990)\n- International Convention on the Rights of Persons with Disabilities (2008)"
  },
  {
    "topic_name": "Regional",
    "content": "In addition, the UDHR inspired action at regional levels across the world. Further covenants and charters include the:\n\n- European Convention on Human Rights (1950)\n- American Convention on Human Rights (1969)\n- African Charter on Human and Peoples' Rights (1981)\n\nThe UK ratified the European Convention on Human Rights (ECHR) in 1951 and it entered into force in 1953. The ECHR is a strong regional structure of human rights protections which is overseen by the European Court of Human Rights which sits in Strasbourg in France. This means that before our Human Rights Act, if an individual wanted to bring a case against a public body or government it would need to be heard in Strasbourg and often involved a very long wait period."
  },
  {
    "topic_name": "Domestic",
    "content": "In 1998, the UK decided to transfer Articles from the European Convention of Human Rights into our domestic law to 'bring human rights home' - this is what we now have today as the Human Rights Act. The rights within the Human Rights Act, brought into UK law from ECHR are interwoven into the devolution arrangements in Northern Ireland, Scotland and Wales. The Scotland Act 1998, the Wales Act 1998 and the Northern Ireland Act 1998 (which is part of an international peace process) established devolved legislatures and administrations. Each devolved nation has a range of issues for which it is responsible, many of which impact on human rights.\n\nIn 1998 when the Human Rights Act was passed, the UK Parliament's Joint Committee on Human Rights (JCHR) described the aims of the legislation as being to create a culture of respect for human rights in the UK.\n\n<!-- image -->\n\nA human rights culture is: '... one that fosters basic respect for human rights and creates a climate in which such respect becomes an integral part of our way of life and a reference point for our dealing with public authorities … in which all our institutional policies and practices are influenced by these ideas…The building of a human rights culture …[depends] not just on courts awarding remedies for violations of individuals' rights, but on decision-makers in all public services internalising the requirements of human rights law, integrating those standards into their policy and decisionmaking processes, and ensuring that the delivery of public services in all fields is fully informed by  human rights considerations.' - Joint Committee on Human Rights\n\nThe Human Rights Act (HRA) is important because it places duties on public bodies to respect and protect rights in everything they do. This means that when interacting with public bodies, people can expect to have their rights protected and if they don't, they can challenge this.\n\nThis transforms public authorities into duty-bearers and individuals into rightsholders. The HRA creates a vital safety net for us all, especially when we are in vulnerable positions, for example when we need care, support or housing.\n\n<!-- image -->"
  },
  {
    "topic_name": "OUR HUMAN RIGHTS ACT",
    "content": "You can read BIHR's full FAQs about the Human Rights Act here.\n\nYou can read BIHR Easy Read explainer about the Human Rights Act here.\n\nYou can watch BIHR's What is the human rights act video here.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "Article 2 - The right to life",
    "content": "Everyone's right to life shall be protected by law."
  },
  {
    "topic_name": "Article 3 - The right to be free from torture and inhuman and degrading treatment",
    "content": "No one shall be subjected to torture or to inhuman or degrading treatment or punishment."
  },
  {
    "topic_name": "Article 4 - The right to be free from slavery and forced labour",
    "content": "No one shall be held in slavery or servitude."
  },
  {
    "topic_name": "Article 5 - The right to liberty",
    "content": "Everyone has the right to liberty and security of person."
  },
  {
    "topic_name": "Article 6 - The right to a fair trial",
    "content": "Everyone is entitled to a fair and public hearing within a reasonable time by an independent and impartial tribunal established by law."
  },
  {
    "topic_name": "Article 7 - The right not to be punished for something that wasn't against the law when you did it",
    "content": "No one shall be held guilty of any criminal offence on account of any act or omission which did not constitute a criminal offence under national or international law at the time when it was committed. Nor shall a heavier penalty be imposed than the one that was applicable at the time the criminal offence was committed."
  },
  {
    "topic_name": "Article 8 - The right to respect for private and family life, home and correspondence",
    "content": "Everyone has the right to respect for their private and family life, home and correspondence.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "Article 9 - The right to freedom of thought, conscience and religion",
    "content": "This right includes freedom to change religion or belief and freedom, either alone or in community with others and in public or private, to manifest religion or belief, in worship, teaching, practice and observance."
  },
  {
    "topic_name": "Article 10 - The right to freedom of expression",
    "content": "This right shall include freedom to hold opinions and to receive and impart information and ideas without interference by public authority."
  },
  {
    "topic_name": "Article 11 - The right of freedom of assembly and association",
    "content": "Everyone has the right to freedom of peaceful assembly and to freedom of association with others, including the right to form and to join trade unions for the protection of the person's interest."
  },
  {
    "topic_name": "Article 12 - The right to marry and start a family",
    "content": "Everyone of marriageable age has the right to marry and to found a family, according to the national laws governing the exercise of this right."
  },
  {
    "topic_name": "Article 14 - The right to be free from discrimination",
    "content": "The enjoyment of the rights and freedoms in this Act shall be without discrimination on any ground such as sex, race, colour, language, religion, political or other opinion, national or social origin, association with a national minority, property, birth, or other status."
  },
  {
    "topic_name": "Article 1, Protocol 1 - The right to peaceful enjoyment of possessions",
    "content": "Article 2, Protocol 1 - The right to education\n\nArticle 3, Protocol 1 - The right to free elections\n\nArticle 1, Protocol 13 - Abolition of the death penalty\n\n<!-- image -->"
  },
  {
    "topic_name": "How the Human Rights Act works with other laws",
    "content": "Section 3 of the Human Rights Act (HRA) means that any laws in the UK (this includes legislation, but also regulations and statutory instruments) must be read and applied in a way which is compatible with the rights in the Act, as far as it is possible to do so.\n\n<!-- image -->\n\nThe HRA can be used as a lens in which to view all other laws and policy. It means that other laws, for example mental health legislation, should not be applied in a way that is incompatible with the HRA. Section 3 an important tool for public officials to use to make rights-respecting decisions. If public officials apply\n\nother laws in a way that respects human rights in the first place, this improves decision-making. This reduces the need for people to take legal cases to courts to challenge decisions which do not respect human rights.\n\nAn example of this is when the courts have ruled against the UK government's attempts to enforce the bedroom tax through Regulations. Lady Hale delivered a unanimous judgment of the Supreme Court, explaining that the UK Government failed to strike a fair balance between the very limited public benefits of the benefit cap and did severe damage to the family lives of young children and their lone parents, if the parents must choose between working outside the home and not having enough for the family to live on. The cap's reduction of benefits to well below the poverty line engages the mothers' and children's right under Article 8 to respect for their family life (HRA/ECHR) and Article 14 (HRA/ECHR), to non-discrimination based on status of 'lone parents of children under two'). The Supreme Court ruled that applying a 14% housing benefit reduction to a man, referred only as RR, was a breach of his right to home under the Human Rights Act.\n\n'The Human Rights Act is an act of the United Kingdom parliament and takes precedence over subordinate legislation such as the regulation in question … This means that incompatible subordinate legislation must simply be ignored … There is nothing unconstitutional about a public authority, court or tribunal disapplying a provision of subordinate legislation which would otherwise result in their acting incompatibly with a Convention right, where this is necessary in order to comply with the HRA. Subordinate legislation is subordinate to the requirements of an Act of Parliament. The HRA is an Act of Parliament and its requirements are clear.'\n\n- R v Secretary of State for Work and Pensions (2019)\n\n<!-- image -->"
  },
  {
    "topic_name": "ECONOMIC, SOCIAL, AND CULTURAL RIGHTS",
    "content": "Our human rights include civil and political rights such as the right to a fair trial or the right to freedom of association. They also include our economic, social, and cultural rights , such as the right  to an adequate standard of living  and to social security.\n\nOur economic, social, and cultural rights are our rights of everyday life. We need them to live a life of dignity and freedom: with a decent job and home, enough to eat, clothes to wear, the chance to learn, and a safety net when we most need it.\n\nThe UK Government ratified the International Covenant on Economic, Social and Cultural Rights in 1976, and this means that UK Government and public bodies are obliged by international law to uphold these rights. But this doesn't always happen. In reality sometimes people in positions of power ignore these rights or make decisions that erode or take our rights away.\n\nWhen that happens, it's hard to hold them to account. Because unlike rights in the European Convention on Human Rights, these rights have not been 'brought home' into our laws across the UK. This means people across the UK experience their rights differently, and our domestic laws around economic, social, and cultural rights issues (such as housing, the minimum wage, and access to healthcare) are not always reflective of the international standards that the UK helped to introduce.\n\nAll this means that although the UK Government has committed to protecting, respecting, and fulfilling these rights of everyday life, it is falling short of meeting its international obligations.\n\nEconomic, social, and cultural rights are key to us achieving permanent lasting solutions to poverty and equality. Making these rights a reality for all means encouraging everyone to know and claim these rights of everyday life , so that we as the people can hold UK governments and public authorities to account and call for our full spectrum of rights to be protected in our domestic laws across the UK.\n\n<!-- image -->"
  },
  {
    "topic_name": "The International Covenant on Economic, Social and Cultural Rights: In Plain English",
    "content": ""
  },
  {
    "topic_name": "Article 1 - Self determination",
    "content": "Everyone has the right to self-determination - that is, to decide their own destiny."
  },
  {
    "topic_name": "Article 2 - Duties and non-discrimination",
    "content": "The government must do everything they can to implement this Covenant. It should progressively improve enjoyment of economic, social and cultural rights over time. To do this, it must use all its available resources (including money). The government must guarantee all economic, social and cultural rights to everyone without exception. It is the government's duty to protect everyone from any form of discrimination. This means that everyone has the same rights, no matter their:\n\n- Sex\n- Race or skin colour\n- Language\n- Religious belief (or lack of)\n- Political opinion\n- How much or little they own\n- What social group they are born into\n- What country they come from\n- Or any other difference"
  },
  {
    "topic_name": "Article 3 - Equality between men and women",
    "content": "Men and women are equal and have the right to enjoy economic, social and cultural rights equally."
  },
  {
    "topic_name": "Article 4 - Limiting rights",
    "content": "The government can sometimes limit rights but only in a small number of specific situations:\n\n- Where the limits are set out in law.\n- Where the limits do not undermine Covenant rights.\n- Where the limits are needed to support a fair and just society.\n- Where the limits are needed to protect the rights of other members of society.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "Article 5 - Preserving rights and freedoms",
    "content": "Nothing in this Covenant can be used as an excuse for governments or people to do anything that to harm the rights of other people."
  },
  {
    "topic_name": "Article 6 - Right to work",
    "content": "You have the right to work, to be free to choose your work, and to defend your rights at work. Governments must help people who do not find such work with education and training."
  },
  {
    "topic_name": "Article 7 - Right to just and favourable conditions at work",
    "content": "Everyone has the right to just and favourable conditions at work. This means everyone has the right to at least the following:\n\n- A fair wage that does not discriminate between different workers.\n- The same pay as anyone else for work of equal value.\n- A wage that allows a person and their family to have a decent life.\n- Safe and healthy working conditions.\n- Equal opportunity to promotion based on only seniority and skill.\n- Rest, leisure and reasonable limitation of working hours.\n- Paid annual holidays and public holidays."
  },
  {
    "topic_name": "Article 8 - Trade union rights",
    "content": "- Everyone has the right to join and to form trade unions, who come together to fight for fair pay and good working conditions. Trade unions can organise nationality and internationally.\n- The government must not interfere with trade unions unless the limitations are set out in law and are to protect the public and their rights and freedoms. The government can limit trade union rights for members of the armed forces, the police and the public service.\n- Everyone has the right to stop work (strike) when they are not being treated fairly."
  },
  {
    "topic_name": "Article 9 - Right to social security",
    "content": "Everyone has the right to social security. This means that governments must make sure there is a social security system that provides money or other support to help people who need it.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "Article 10 - Protecting the family - especially mothers and children",
    "content": "- Governments must give special protection and help to the family, especially mothers and children.\n- Everyone has the right to choose whether to marry and who to marry.\n- Governments must protect mothers during pregnancy as well as before and after giving birth, including by making sure working mothers have paid maternity leave. Children must be given special help regardless of who their parents are or what form their family takes.\n- Governments must protect children and young persons from exploitation (being taken advantage of) and ban any work that is dangerous to them and punish employers who break these laws.\n- Governments must set an age below which children must not work."
  },
  {
    "topic_name": "Article 11 - Right to an adequate standard of living",
    "content": "- Everyone has the right to an adequate standard of living for themselves and their family - this includes good food, housing and clothing.\n- Everyone has the right to a quality of living that gets better over time.\n- Everyone has the right to be free from hunger. All governments have the duty to make sure that world food supplies reach everyone fairly so that no one goes hungry.\n- Governments must work towards making these rights real for everyone, including by working with other governments."
  },
  {
    "topic_name": "Article 12 - Right to health (physical and mental)",
    "content": "Everyone has the right to the best standard of health possible for both their physical and mental health. Governments have to take steps to:\n\n- Make sure fewer babies die, both before and after birth.\n- Make sure children can grow up healthily.\n- Improve the environments in which people live and work so that these do not hurt their health.\n- Do what is needed to prevent, control and treat diseases.\n- Promote a health system so that everyone can get medical help when sick.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "Article 13 - Right to education",
    "content": "Everyone has the right to go to education. The purpose of education is to:\n\n- Help people fully develop their personalities and understand their value as people.\n- Understand our own rights, and to respect other people's rights and differences.\n- Help people to take part in the society that they live in and to live peacefully, and with respect for all.\n\nTo fulfil the right to education, governments must make sure:\n\n- Primary education is compulsory and free to all.\n- Secondary education (in a variety of forms) should be available to everyone and, as time passes, it should be made free.\n- Higher education should be available to everyone and, as time passes, it should be made free.\n- People who have not finished primary education are able to access other forms of education.\n- They develop the school system and continuously improve the conditions of teachers."
  },
  {
    "topic_name": "Finally:",
    "content": "- Parents and guardians have the freedom to choose which schools their children attend so long as those schools meet the government's minimum education standards.\n- Parents and guardians have the freedom to choose the religious and moral education of their children.\n- Anyone can establish and lead schools so long as they respect the government's minimum education standards."
  },
  {
    "topic_name": "Article 14 - Implementing free primary education",
    "content": "Within two years of joining this Covenant, governments must have a plan of action to make sure that primary education is compulsory and free for everyone."
  },
  {
    "topic_name": "Article 15 - Cultural rights",
    "content": "Everyone has the right to participate in cultural activities, to benefit from the results of scientific progress, and to own any idea or design that they came up with. Governments must:\n\n- Conserve, develop and distribute science and culture.\n- Respect the freedom to engage in research and to create art."
  },
  {
    "topic_name": "Article 25 - Using natural wealth and resources",
    "content": "This article explains that nothing in the Covenant can be used to limit the right of all peoples to enjoy and use their natural wealth and resources (such as water, land, minerals etc.) freely.\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "WHAT CAN RIGHTS DO FOR YOU?",
    "content": "Knowing and claiming our rights is not always about quoting case law, or taking someone to court, it's about having the confidence to challenge decisions - such as by our GPs, local authorities or schools and speaking up against unfair treatment.\n\nTalking about rights, understanding them, and claiming them is important. As shown in this resource, the UK has been instrumental in developing human rights laws at every level, yet many of us across the country are systematically denied access to the rights we are entitled to.\n\nDespite being one of the world's richest countries, a fifth of the UK population lives in poverty. As NHS and local authority budgets are stripped to the bone, schools and services shuttered, and many of us, particularly the most disadvantaged and discriminated against in our community, are shut out of the public conversation.\n\nWhen we come together to talk about and claim our rights, good things happen. You can learn more about the value of rights, and see how others have used human rights to make change, in the other sections of this resource pack:\n\n- The value of human rights\n- Stories of a human rights-based approach\n\n<!-- image -->\n\n<!-- image -->"
  },
  {
    "topic_name": "FURTHER READING",
    "content": ""
  },
  {
    "topic_name": "Learn more about the Human Rights Act",
    "content": ""
  },
  {
    "topic_name": "Human Rights Act, 1998",
    "content": "The text of the Human Rights Act"
  },
  {
    "topic_name": "Your Easy Read Guide to the Human Rights Act",
    "content": "An Easy Read guide to your rights under the Human Rights Act, and where they come from"
  },
  {
    "topic_name": "Where do my rights apply?",
    "content": "The British Institute of Human Rights' guide to human rights"
  },
  {
    "topic_name": "What duties do organisations have?",
    "content": "The British Institute of Human Rights' guide to public authority duties"
  },
  {
    "topic_name": "Learn more about your economic, social and cultural rights",
    "content": ""
  },
  {
    "topic_name": "International Covenant on Economic, Social and Cultural Rights",
    "content": "The text of the International Covenant on Economic, Social and Cultural Rights"
  },
  {
    "topic_name": "Easy-to-read version of the Human Rights Covenants",
    "content": "An easy-to-read version of the International Covenants on Economic, Social and Cultural Rights, and Civil and Political Rights"
  },
  {
    "topic_name": "Child-friendly version of the International Covenant on Economic, Social and",
    "content": ""
  },
  {
    "topic_name": "Cultural Rights",
    "content": "Our rights and what they mean for children"
  },
  {
    "topic_name": "Submission to the UN Committee on Economic, Social and Cultural Rights",
    "content": "Report on the state of economic, social and cultural rights of people living in England and Wales (2023)"
  },
  {
    "topic_name": "The route to economic, social and cultural rights justice",
    "content": "Just Fair's 5 principles for rights incorporation\n\n<!-- image -->"
  },
  {
    "topic_name": "CONTACT US",
    "content": "Just Fair's website info@justfair.org.uk\n\nThe British Institute of Human Rights' website info@bihr.org.uk\n\n© 2024 The British Institute of Human Rights and Just Fair. This publication and its content may be used and distributed by individuals and groups for information and advocacy purposes only. It must not be used for commercial purposes. Any noncommercial copying of the materials must be unadapted and attributed to the British Institute of Human Rights and Just Fair, with written notification sent to both organisations at info@bihr.org.uk and info@justfair.org.uk respectively.\n\nThe British Institute of Human Rights is a registered charity (1101575) and registered company (4978121). Registered address (not open to visitors): BIHR, 167169 Great Portland Street, Fifth Floor, London, W1W 5PF. Find us at bihr.org.uk or @BIHRHumanRights and contact us on info@bihr.org.uk. BIHR does not provide individual or legal advice. For suggestions on where to get further support please visit www.bihr.org.uk/help\n\nJust Fair is a registered charity (1141484) and registered company (07394478). Registered address: Just Fair, c/o Doughty Street Chambers, 53-54 Doughty Street, London WC1N 2LS. Find us at justfair.org.uk or @JustFairUK and contact us on info@justfair.org.uk.\n\n<!-- image -->"
  }
]